app/controllers/notes_controller.rb

  def show
    @shared_users = @note.users.where.not(id: @note.created_user)
---
SELECT "users".* FROM "users" INNER JOIN "notes_users" ON "users"."id" = "notes_users"."user_id" WHERE "notes_users"."note_id" = ? AND ("users"."user_id" != 3)  [["note_id", 5]]

  def create
    @note = Note.new(note_params)
    @note.user_id = @user.id
    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("user_id", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "Test"], ["description", "Trial Traisl"], ["created_at", "2021-05-30 12:16:50.233774"], ["updated_at", "2021-05-30 12:16:50.233774"]]

  def update
    respond_to do |format|
      if @note.update(note_params)
---
UPDATE "notes" SET "description" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["description", "Trial Traisl 313123123"], ["updated_at", "2021-05-30 12:18:45.250293"], ["id", 1]]

  def share_note
    @share_users = User.where.not(id: @note.users, role: 'admin').map{|u| [u.email, u.id]}
---
SELECT "users".* FROM "users" WHERE ("users"."id" NOT IN (SELECT "users"."id" FROM "users" INNER JOIN "notes_users" ON "users"."id" = "notes_users"."user_id" WHERE "notes_users"."note_id" = ?)) AND ("users"."role" != ?)  [["note_id", 1], ["role", 0]]

  def share
    if params[:shared_user_id].present?
      shared_user = User.find(params[:shared_user_id])
      @note.users << shared_user unless @note.users.include?(shared_user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "notes_users" ON "users"."id" = "notes_users"."user_id" WHERE "notes_users"."note_id" = ? AND "users"."id" = ? LIMIT ?  [["note_id", 5], ["id", 1], ["LIMIT", 1]]

  def remove_shared_user
    if params[:shared_user_id].present?
      shared_user = User.find(params[:shared_user_id])
      byebug
      @note.users.delete(shared_user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" IN (SELECT "users"."id" FROM "users" INNER JOIN "notes_users" ON "users"."id" = "notes_users"."user_id" WHERE "notes_users"."note_id" = ? AND ("users"."id" != 3) AND "users"."id" = 1)  [["note_id", 5]]

    def set_user
      @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_note
      @note = @user.notes.find(params[:id])
---
SELECT  "notes".* FROM "notes" INNER JOIN "notes_users" ON "notes"."id" = "notes_users"."note_id" WHERE "notes_users"."user_id" = ? AND "notes"."id" = ? LIMIT ?  [["user_id", 3], ["id", 5], ["LIMIT", 1]]